---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathLayoutStepFailed
source: html/a005d79a-e14d-e940-8497-0b18c1e08889.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathLayoutStepFailed Property

Layout algorithm failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedPathLayoutStepFailed { get; }
```